app/controllers/dogs_controller.rb

SELECT * FROM `dogs`
---
  def index
    @dogs = Dog.find :all

SELECT * FROM `dogs` WHERE (`dogs`.`id` = 1)
---
  def show
    @dog = Dog.find params[:id]

SELECT * FROM `dogs` WHERE (`dogs`.`id` = 1)
---
  def edit
    @dog = Dog.find params[:id]

SELECT * FROM `dogs` WHERE (`dogs`.`id` = 1)
UPDATE `uploads` SET `description` = '555', `updated_at` = '2016-01-28 08:06:03' WHERE `id` = 1
INSERT INTO `uploads` (`updated_at`, `photo_file_size`, `created_at`, `dog_id`, `description`, `photo_file_name`) VALUES('2016-01-29 02:57:59', NULL, '2016-01-29 02:57:59', 1, NULL, NULL)
---
  def update
    @dog = Dog.find params[:id]
    #@upload = @dog.uploads.new
    @upload = @dog.uploads.build

    respond_to do |format|
      if @dog.update_attributes params[:dog]
        @upload.save

INSERT INTO `dogs` (`name`, `updated_at`, `created_at`) VALUES('妹妹', '2016-01-29 03:07:47', '2016-01-29 03:07:47')
---
  def create
    @dog = Dog.new params[:dog]

    if @dog.save